#### Mariusz Kuchta gr. 2a - Analiza i Bazy Danych
Zadanie 4

Utworzenie dataframu i przetestowanie podstawowych metod

In [1]:
import pandas as pd

d = {'name': ['Adam', 'Anna', 'Alicja', 'Amadeusz', 'Aleksander'],
     'surname': ['Kowalski', 'Nowak', 'Wójcik', 'Kowalewski', 'Sikora'], 
     'age': [34, 45, 45, 23, 32],
     'sex': ['male', 'female', 'female', 'male', 'male']}

dataframe = pd.DataFrame(data = d)

In [3]:
dataframe

         name     surname  age     sex
0        Adam    Kowalski   34    male
1        Anna       Nowak   45  female
2      Alicja      Wójcik   45  female
3    Amadeusz  Kowalewski   23    male
4  Aleksander      Sikora   32    male

In [2]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     5 non-null      object
 1   surname  5 non-null      object
 2   age      5 non-null      int64
 3   sex      5 non-null      object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes

In [4]:
dataframe.head(3)

     name   surname  age     sex
0    Adam  Kowalski   34    male
1    Anna     Nowak   45  female
2  Alicja    Wójcik   45  female

In [5]:
dataframe.describe()

             age
count   5.000000
mean   35.800000
std     9.364828
min    23.000000
25%    32.000000
50%    34.000000
75%    45.000000
max    45.000000